app/controllers/sessions_controller.rb

  def create
    if openid = request.env[Rack::OpenID::RESPONSE]
      case openid.status
      when :success
        ax = OpenID::AX::FetchResponse.from_success_response(openid)
        user = User.where(:identifier_url => openid.display_identifier).first
        user ||= User.create!(:identifier_url => openid.display_identifier,
                              :email => ax.get_single('http://axschema.org/contact/email'),
                              :first_name => ax.get_single('http://axschema.org/namePerson/first'),
                              :last_name => ax.get_single('http://axschema.org/namePerson/last'))
---
SELECT "users".* FROM "users" WHERE "users"."identifier_url" = 'https://www.google.com/accounts/o8/id?id=AItOawnm5qn609li5HsuOwnrvPJ6-Kj_eO3iwws' ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "users" ("created_at", "email", "first_name", "identifier_url", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)